Repository: kevin4dhd/flutter_boilerplate_clean
Catalog: resources/lib/src/l10n/intl_*.arb
Languages: es, it, tr

source: Login
es: Iniciar sesión
it: Accedi
tr: Giriş yap

source: Fake Login
es: Inicio de sesión falso
it: Accesso falso
tr: Sahte giriş

source: Logout
es: Cerrar sesión
it: Esci
tr: Çıkış yap

source: Email
es: Correo electrónico
tr: E-posta

source: Password
es: Contraseña
tr: Şifre

# unknownException
source: unknownException ({errorCode})
es: Excepción desconocida ({errorCode})
it: Eccezione sconosciuta ({errorCode})
tr: Bilinmeyen istisna ({errorCode})

source: parseException
es: Excepción de análisis
it: Eccezione di analisi
tr: Ayrıştırma hatası

source: cancellationException
es: Excepción por cancelación
it: Eccezione di annullamento
tr: İptal hatası

source: noInternetException
es: Sin conexión a Internet
it: Nessuna connessione a Internet
tr: İnternet bağlantısı yok

source: timeoutException
es: Excepción por tiempo de espera
it: Tempo scaduto
tr: Zaman aşımı

source: badCertificateException
es: Certificado no válido
it: Certificato non valido
tr: Geçersiz sertifika

# canNotConnectToHost
source: Can not connect to this host
es: No se puede conectar con este host
it: Impossibile connettersi all'host
tr: Ana bilgisayara bağlanılamıyor

source: tokenExpired
es: Token expirado
it: Token scaduto
tr: Jeton süresi doldu

source: emptyEmail
es: Correo electrónico vacío
it: Email vuota
tr: E-posta boş

source: invalidEmail
es: Correo electrónico inválido
it: Email non valida
tr: Geçersiz e-posta

source: invalidPassword
es: Contraseña inválida
it: Password non valida
tr: Geçersiz şifre

source: invalidUserName
es: Nombre de usuario inválido
it: Nome utente non valido
tr: Geçersiz kullanıcı adı

source: invalidPhoneNumber
es: Número de teléfono inválido
it: Numero di telefono non valido
tr: Geçersiz telefon numarası

source: invalidDateTime
es: Fecha u hora inválida
it: Data o ora non valida
tr: Geçersiz tarih/saat

source: passwordsAreNotMatch
es: Las contraseñas no coinciden
it: Le password non corrispondono
tr: Şifreler uyuşmuyor

source: OK
es: Aceptar
tr: Tamam

source: Cancel
es: Cancelar
it: Annulla
tr: İptal

source: Retry
es: Reintentar
it: Riprova
tr: Yeniden dene

source: Close
es: Cerrar
it: Chiudi
tr: Kapat

source: Search
es: Buscar
it: Cerca
tr: Ara

source: My Page
es: Mi página
it: La mia pagina
tr: Sayfam

source: Home
es: Inicio
tr: Ana sayfa

source: Dark Theme
es: Tema oscuro
it: Tema scuro
tr: Karanlık tema

source: Japanese
es: Japonés
it: Giapponese
tr: Japonca

source: English
es: Inglés
it: Inglese
tr: İngilizce

source: Spanish
es: Español
it: Spagnolo
tr: İspanyolca

source: Continue
es: Continuar
it: Continua
tr: Devam et

# termsPrivacyConsent
source: By tapping 'Continue', you agree to and accept our {Terms of Service,1} and our {Privacy Policy,2}.
es: Al tocar 'Continuar', aceptas y consientes nuestros {Términos de servicio,1} y nuestra {Política de privacidad,2}.
it: Toccando 'Continua', accetti e acconsenti ai nostri {Termini di servizio,1} e alla nostra {Informativa sulla privacy,2}.
tr: 'Devam et'e dokunarak {Hizmet Şartları,1} ve {Gizlilik Politikası,2}'nı kabul etmiş olursunuz.

# createNewWallet
source: Create a new wallet
es: Crear nueva billetera
it: Crea un nuovo portafoglio
tr: Yeni bir cüzdan oluştur

source: Secret Phrase
es: Respalda tu Frase Secreta
it: Frase Segreta
tr: Gizli İfade

source: Add existing wallet
es: Ya tengo una billetera
it: Aggiungi portafoglio esistente
tr: Cüzdanı ekle

# importRestoreViewOnly
source: Import, restore or view-only
es: Importar billetera existente
it: Importa, ripristina o solo visualizzazione
tr: Görüntüle ve geri yükle

source: Popular communities
es: Comunidades populares
it: Comunità popolari
tr: Popüler topluluklar

source: Global community
es: Comunidad global
it: Comunità globale
tr: Küresel topluluk

source: Create Passcode
es: Crea un PIN de acceso
it: Crea Codice di Accesso
tr: Şifre oluştur

# enterPasscodeRemember
source: Enter a passcode. Be sure to remember it. so you can unlock your wallet.
es: Introduce un número que puedas recordar.
it: Inserisci un codice. Assicurati di ricordarlo. per sbloccare il tuo portafoglio.
tr: Şifrenizi girin. Unutmadığınızdan emin olun.

# insecurePass
source: Insecure password. Please try another one.
es: Contraseña insegura. Intenta con otra.
it: Password non sicura. Prova con un'altra.
tr: Güvensiz şifre. Lütfen başka bir tane deneyin.

source: Confirm Passcode
es: Confirma PIN de acceso
it: Conferma Codice di Accesso
tr: Şifreyi doğrula

# confirmPasscodeInstruction
source: Enter a passcode. Be sure to remember it. so you can unlock your wallet.
es: Confirma tu PIN, no lo olvides, lo necesitáras para desbloquear tu billetera.
it: Inserisci un codice di accesso. Assicurati di ricordarlo. per sbloccare il tuo portafoglio.
tr: Bir şifre girin. Onu hatırladığınızdan emin olun. cüzdanınızı açabilmek için.

source: Enable Face ID
es: Activar Face ID
it: Abilita Face ID
tr: Face ID'yi etkinleştir

source: Enable Fingerprint
es: Activar Huella
it: Abilita Impronta Digitale
tr: Parmak izini etkinleştir

# passcodeError
source: The passcode is not the same.
es: El PIN no coincide.
it: Il codice di accesso non corrisponde.
tr: Şifre aynı değil.

# signInTitle
source: Authentication Required
es: Autenticación Requerida
it: Autenticazione richiesta
tr: Kimlik Doğrulama Gerekli

# goToSettingsButton
source: Go to Settings
es: Ir a Configuración
it: Vai alle Impostazioni
tr: Ayarlar'a Git

# goToSettingsDescription
source: Please set up your fingerprint.
es: Por favor, configura tu huella digital.
it: Configura la tua impronta digitale.
tr: Lütfen parmak izinizi ayarlayın.

# biometricHint
source: Touch the fingerprint sensor.
es: Toca el sensor de huellas dactilares.
it: Tocca il sensore di impronte digitali.
tr: Parmak izi sensörüne dokunun.

# biometricNotRecognized
source: Fingerprint not recognized. Try again.
es: Huella no reconocida. Intenta de nuevo.
it: Impronta non riconosciuta. Riprova.
tr: Parmak izi tanınmadı. Lütfen tekrar deneyin.

# biometricRequiredTitle
source: Biometric Required
es: Biometría Requerida
it: Biometria richiesta
tr: Biyometri Gerekli

# deviceCredentialsRequiredTitle
source: Device Credentials Required
es: Credenciales del Dispositivo Requeridas
it: Credenziali del dispositivo richieste
tr: Cihaz Kimlik Bilgileri Gerekli

# deviceCredentialsSetupDescription
source: Set up your device's screen lock.
es: Configura el bloqueo de pantalla de tu dispositivo.
it: Configura il blocco schermo del dispositivo.
tr: Cihaz ekran kilidini ayarlayın.

# localizedReason
source: Authenticate to securely access the app.
es: Autentícate para acceder de forma segura a la app
it: Autenticati per accedere in modo sicuro all'app.
tr: Uygulamaya güvenli erişim sağlamak için kimlik doğrulaması yapın.

source: Backup
es: Respaldo
tr: Yedekle

source: Back up secret phrase
es: Frase Secreta
it: Backup frase segreta
tr: Gizli ifadeyi yedekle

# protectAssetsBackupInstruction
source: Save these 12 words in a safe place. If you lose this phrase, you will not be able to regain access to your Hi-G wallet.
es: Guarda estas 12 palabras en un lugar seguro. Si pierdes esta frase, no podrás recuperar el acceso a tu billetera Hi-G
it: Salva queste 12 parole in un posto sicuro. Se perdi questa frase, non potrai riottenere l'accesso al tuo portafoglio Hi-G.
tr: Bu 12 kelimeyi güvenli bir yerde saklayın. Bu ifadeyi kaybederseniz, Hi-G cüzdanınıza erişiminizi geri kazanamazsınız.

# backupWarning
source: I understand that if I lose or forget this secret phrase I will lose access to my Hi-G wallets.
es: Entiendo que si pierdo o me olvido de esta Frase Secreta, perderé el acceso a mis billeteras Hi-G.
it: Comprendo che se perdo o dimentico questa frase segreta perderò l'accesso ai miei portafogli Hi-G.
tr: Bu gizli ifadeyi kaybedersem veya unutursam, Hi-G cüzdanlarıma erişimi kaybedeceğimi anlıyorum.

source: Backup Manually
es: Respaldar & Continuar
it: Backup Manuale
tr: Manuel Yedekle

# errorGeneratingSecretPhrase
source: Error generating the secret phrase
es: Error al generar la frase secreta
it: Errore durante la generazione della frase segreta
tr: Gizli ifade oluşturulurken hata oluştu

# confirmSeedPhraseTitle
source: Confirm Seed Phrase
es: Confirma tu Frase Secreta
it: Conferma Frase Seed
tr: Gizli ifadeyi doğrula

# confirmSeedPhraseInstruction
source: Select each word in the order it was presented to you:
es: Selecciona cada palabra en el orden en que aparecieron en la pantalla anterior:
it: Seleziona ogni parola nell'ordine in cui ti è stata presentata:
tr: Her kelimeyi size sunulduğu sırayla seçin:

# somethingWrong
source: Something went wrong
es: Algo salió mal
it: Qualcosa è andato storto
tr: Bir şeyler ters gitti

source: Sequence mismatch
es: Secuencia incorrecta
it: Sequenza errata
tr: Sıra uyuşmuyor
